БИТУправление_медицинским_центром_демо/src/Catalogs/ОграниченияДействийМедосмотра/ОграниченияДействийМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОграниченияДействийМедосмотра</name>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастОценкаДостижения</name>
    <comment>Ложь - Старше, Истина - Младше</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ПолФизическихЛиц/ПолФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическихЛиц</name>
  <comment>Пол физических лиц</comment>
  <enumValues>
    <name>НеУказан</name>
    <comment>Пол не указан</comment>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
    <comment>Пол мужской</comment>
  </enumValues>
  <enumValues>
    <name>Женский</name>
    <comment>Пол женский</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ОграниченияДействийМедосмотра/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВозрастПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВозрастОценкаДостиженияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	СтрокаПола = "";
	Если Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическихЛиц.Женский") Тогда
		СтрокаПола = "для женщин";
	ИначеЕсли Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическихЛиц.Мужской") Тогда
		СтрокаПола = "для мужчин";
	КонецЕсли;
	Если Объект.Возраст > 0 Тогда
		СтрокаВозраста = НРег(Элементы.ВозрастОценкаДостижения.ТекстРедактирования) + " " + ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(ДобавитьМесяц(ТекущаяДата(),Объект.Возраст * -12));
	КонецЕсли;
	Объект.Наименование = СокрЛП(СтрокаПола + " " + СтрокаВозраста);
КонецПроцедуры

#КонецОбласти
